import React, {Component} from 'react';
import Group from "./Group";
import Title from '../Title/Title'
import './GroupLessons(back-free).css'
import practiceGroupImg from '../../assets/practic-psyhology-group.jpg'
import terapevtGroupImg from '../../assets/TerapevtGroup.jpg'
import gestaltGroupImg from '../../assets/gestaltImage.jpg'
import axios from "axios"
class GroupLessonsBackFree extends Component {
    constructor(props){

        super(props);
        this.state = {
            groups : []
        };

    }
    componentDidMount() {
        this.findGroups();

    }

    findGroups() {
        axios.get("http://localhost:8080/adminPanel/getEvent")
            .then(response => response.data)
            .then((data) => {
                this.setState({groups: data});
                console.log(this.state.groups)
            });
    }
    renderItem(){
        return(
            <>
                {
                    this.state.groups&&this.state.groups.map((group, index) => (
                        <Group group={group}/>
                    )) }
            </>
        );
    }
    render() {
        const groupTitleText = 'Групові заняття';
        const practicGroupTitle = 'Практична психологія';
        const gestaltGroupTitle = 'Основи гештальт-терапії';
        const practicGroupText = 'Учасники курсу отримають знання з психології, психотерапії які зможуть застосовувати' +
            ' в житті, в професійній діяльності, стосунках (в особистих і ділових).\n' +
            'В групі буде робота з метафоричними малюнками, засобами арт-терапії, терапевтичними казками,  життєвими сценаріями.' +
            '\nЗаняття проходитимуть у формі інтерактивних лекцій та практичних вправ.\n' +
            'Після завершення курсу кожен учасник отримає сертифікат НЦ «Інституту практичної психології та психотерапії»' +
            ' Національного університету «Острозька академія»';
        const practicGroupAdditionalText = 'Початок   по мірі набору групи (осінь 2021р)'+
            ' Зустрічі по суботах, один раз в три тижні з 10.00 до 14.00. Всього 12 зустрічей. ' +
            'Ведучі  тренери групи: ' +
            'Практикуючі психологи,  психотерапевти, викладачі (Галина Гандзілевська, Аліна Прокопенко, Уляна Нікітчук)\n' +
            'Ведучий тренер та автор програми: Марія Шугай.\n Теми: ' +
            'Мотивація і потреби особистості; ' +
            'Психологія розвитку: від народження до зрілості; ' +
            'Психологія стосунків. ' +
            'Про емоції та емоційний інтелект. ' +
            'Дизайн мислення. ' +
            'Психодрама , життєві сценарії та особистісні ресурси. ' +
            'Активація драйву засобами арт-терапії, казкотерапія. ' +
            'Психологія сексуальності. ' +
            'Психічне здоров’я, психосоматика. ' +
            'Кризові ситуації в житті та емоційна саморегуляція.';

        const terapevtGroupTitle = 'Терапевтична група';
        const terapevtGroupText = 'Для мене цінність саме терапевтичних груп, щоб учасники не тільки сприймали якусь' +
            ' інформацію, отримувати знання про щось (хоча своїми знаннями з теорії  психології, психотерапії готова ' +
            ' з радістю ділитись, люблю це, за потребою й інтересом учасників), а як можливість саме зустрітись таким ' +
            'різним людям, обмінятись думками, переживаннями, пошукати різні способи як знайти це «місце зустрічі», ' +
            ' контакту, що так важливо для стосунків. ';
        const terapevtGroupAdditionalText = 'Будуть зустрічі присвячені окремим темам за запитами учасників. \n' +
            'Про стосунки, як в них бути, або як в них опинитись. Як знайти способи прояву своєї любові, теплоти, ніжності,  уважності до себе самого та до близьких,  дорогих нам людей. Як таких людей в своє життя «впустити».\n' +
            'Про різні почуття (любов, злість, заздрість, розгубленість…) та форми їх вираження й розміщення в контакті, про те як зрозуміти «Що ж я хочу насправді?»,\n' +
            'Як бути в довготривалих стосунках,  прощатись, якщо залишатись неможливо, відчувати те, що не підходить в стосунках і вчасно про це повідомляти, жити із своєю силою і ранимістю,   бути турботливим до себе і уважним й зацікавленим  іншою,  дорогою й близькою людиною, але правда, іншою…\n' +
            'Як цю іншість приймати.\n' +
            'Подосліджуємо, цікаво те, як ми творимо своє життя, його якість та складність своїми виборами та вчинками.\n' +
            'Група до 8 учасників. Вартість 600 грн. за зустріч.';
        const gestaltGroupText = 'Друзі, унікальна можливість навчання гештальт-терапії в Рівному. ' +
            'Київський Гештальт Університет оголошує новий набір в Рівному в ' +
            'навчально-терапевтичну групу програми 1-го ступеня «Основи гештальт-терапії»\n' +
            'Київський Гештальт Університет (КГУ)  є акредитованим у Європейській Асоціації Гештальт-Терапії ' +
            '(EAGT) та Європейській Асоціації Психотерапії (EAP). По завершенню програми – сертифікат КГУ.';
        const gestaltGroupAdditionalText = 'До участі  в програмі запрошуємо всіх хто бажає:\n' +
            'Ознайомитись з гештальт-терапією на практиці, зрозуміти і стати більш чутливим і уважним до себе й інших, своїх потреб і задоволення від життя;\n' +
            'Більше усвідомити про себе,  використовувати отриманні знання в житті, в  стосунках, у своїй професійній діяльності.;\n' +
            'Всіх, хто можливо  хотів би почати свій професійний шлях підготовки спеціалістів в гештальт-підході (психологів-консультантів, психотерапевтів).' +
            'Участь в програмі  дає можливість:\n' +
            'спробувати на практиці різні техніки, які використовуються  в гештальт-підході;\n' +
            'навчитись використовувати отриманні знання й досвід в особистому житті, психологічній самопідтримці;\n' +
            'отримати кваліфіковану психотерапевтичну допомогу й підтримку;\n' +
            'продовжити навчання з професійної підготовки гештальт-консультантів (гештальт-терапевтів),' +
            ' особистий досвід участі в групі 1 ступеня є важливим етапом навчання і підготовки практикуючих гештальт-терапевтів.' +
            'Основні теми і навички:\n' +
            'Усвідомлення як інструмент терапевтичних змін.\n' +
            'Потреби – розпізнавання і  задоволення.\n' +
            'Емоції – в чому їх цінність і способи їх вираження.\n' +
            'Встановлення  і підтримування контакту з іншими людьми.\n' +
            'Конфлікти і способи їх врегулювання.\n' +
            'Відповідальність, її форми і порушення балансу.\n' +
            'Про свободу вибору і стосунки.Тривалість програми: 9 зустрічей по 2 дні , заняття в суботу й неділю з ' +
            '10.00 до 18.00, з перервами на обід і каву брейки (загальний курс — 150 год).\n' +
            'Періодичність: двохденні групи проходять один раз в 1,5 місяці.' +
            'По завершенню програми видається сертифікат I ступеня Киівського Гештальт Університету, який дозволяє ' +
            'продовжити навчання на II  ступені професійної підготовки гештальт-терапевтів і консультантів.\n' +
            'Вартість однієї двохденки – 2200 гривень.';
        const practicGroupShortInfo = {
            location:'Рівне',
            time: 'Сб, 10:00 - 14:00',
            date: 'Осінь 2021',
            id: '1'
        };
        const terapevtGroupShortInfo = {
            location:'Рівне',
            time: 'Сб, 11:00 - 14:30',
            date: 'Червень 2021',
            id: '2'
        };
        const gestaltGroupShortInfo = {
            location:'Рівне',
            time: 'Сб-Нд, 10:00 - 18:00',
            date: 'Група розпочата',
            id: '3'
        };
        const groupTitleStyle = {
            padding: '125px 0 50px 0'
        };
        return (
            <section className="group-lessons-section">
                <div className="group-lessons-container">
                    <Title style={groupTitleStyle} text={groupTitleText}/>
                    <div className="group-lessons__inner">
                        {this.renderItem()}
                    </div>
                </div>
            </section>
        );
    }
}

export default GroupLessonsBackFree;